project06/app/controllers/roles_controller.rb

  def index
    @roles = Role.all
---
SELECT * FROM "roles"