project06/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @user.role_id = Role.find_by_role_name("member")

    if !verify_recaptcha
      flash[:error] = "There was an error with the recaptcha code below. Please re-enter the code and click submit."
      render :action => 'new'
      return
    end

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name_last", "created_at", "last_request_at", "updated_at", "username", "failed_login_count", "current_login_ip", "current_login_at", "login_count", "persistence_token", "name_first", "last_login_ip", "password", "last_login_at", "email") VALUES('', '2011-02-28 01:56:37', '2011-02-28 01:56:37', '2011-02-28 01:56:37', 'asdf', 0, '127.0.0.1', '2011-02-28 01:56:37', 1, '5de272258bca1bc65113dd4000ef3773b25a6c877dc5c3493c8c0bd142900b5cb6df1a6481972f752cc94f82f9e4d42721780d47dc581e3fceffde517ded73ee', 'asdf', NULL, 'asdf', NULL, 'test@test.com')