project05/app/controllers/documents_controller.rb

SELECT * FROM "documents" ORDER BY create_date DESC LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "documents"
---
  def index
    @documents = Document.find(:all)

    @docPages = Document.paginate(:page => params[:page], :order => 'create_date DESC')

SELECT * FROM "documents" WHERE ("documents"."id" = 1)
---
  def show
    @document = Document.find(params[:id])

SELECT * FROM "documents" WHERE ("documents"."id" = 1)
---
  def edit
    @document = Document.find(params[:id])

INSERT INTO "documents" ("created_at", "title", "author", "body", "updated_at", "create_date", "edit_count") VALUES('2011-02-05 22:33:57', 'Test Doc 2', 'You Youyou', 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Suspendisse erat tellus, luctus ut laoreet eu, lobortis et mauris. Praesent purus justo, placerat in euismod sit amet, commodo in dui. Curabitur quis neque sit amet lacus pharetra dictum id quis nisl. Ut ut odio enim, et ullamcorper nunc. Suspendisse pretium pretium diam eu pulvinar. Morbi sagittis est nunc. Curabitur eu magna in eros congue feugiat. In hac habitasse platea dictumst. Phasellus convallis urna diam. Maecenas dolor purus, ullamcorper at luctus venenatis, tempor ac ligula. Donec turpis dolor, pharetra sit amet ornare non, mollis vitae lacus. Pellentesque justo ante, mollis sed convallis in, eleifend eu sapien. Cras leo dolor, dapibus eu viverra eu, feugiat ac eros. Praesent imperdiet justo eu dolor bibendum consectetur. Nam a purus ac dolor suscipit dictum. Nam aliquam iaculis lorem eget tempus. Suspendisse sed enim sit amet urna molestie venenatis sit amet non elit. Morbi a odio vel nisl gravida sodales.
---
  def create

    @document = Document.new(params[:document])
    @document.edit_count = 0
    @authorList = Author.find(:all)

    respond_to do |format|
      if @document.save

SELECT * FROM "documents" WHERE ("documents"."id" = 1)
UPDATE "documents" SET "updated_at" = '2011-02-06 22:04:10', "author" = 'Meme' WHERE "id" = 1
---
  def update
    @document = Document.find(params[:id])

    respond_to do |format|
      if @document.update_attributes(params[:document])

SELECT * FROM "documents" WHERE ("documents"."id" = 2)
DELETE FROM "documents" WHERE "id" = 2
---
  def destroy
    @document = Document.find(params[:id])
    @document.destroy